20-rails-review/app/views/instructors/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 3]]
SELECT AVG("students"."age") FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 4]]
---

<h3> Average Age: <%= @instructor.students.average(:age) %> </h3>

SELECT "students".* FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 4]]
---
<ul>
    <% @instructor.students_sorted.each do |student| %>