19-Rails-Validations/app/controllers/books_controller.rb

SELECT "authors".* FROM "authors"
---
    def new
        @book = Book.new
        @authors = Author.all

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "TEST Book"], ["created_at", "2020-06-23 15:45:12.812714"], ["updated_at", "2020-06-23 15:45:12.812714"]]
---
    def create
        # byebug
        book = Book.create(book_params)

SELECT "authors".* FROM "authors"
---
    def edit
        @authors = Author.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_book
        @book = Book.find(params[:id])