17-Rails-forms/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "breed", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ruby"], ["breed", "Corgi"], ["age", 7], ["created_at", "2020-06-22 14:46:30.863271"], ["updated_at", "2020-06-22 14:46:30.863271"]]
---
    def create
        # byebug
        dog = Dog.create(dog_params)

UPDATE "dogs" SET "name" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["name", "Ruby Sr."], ["updated_at", "2020-06-22 19:52:47.931448"], ["id", 4]]
---
    def update
        # byebug

        # dog = Dog.find(params[:id])
        @dog.update(dog_params)

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def current_dog
        @dog = Dog.find(params[:id])