17-Rails-forms/app/controllers/dogs_controller.rb

    def show
        # byebug
        @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]