29-Rails-API/backend/app/controllers/api/v1/instructors_controller.rb

SELECT "instructors".* FROM "instructors"
---
    def index
        instructors = Instructor.all

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        instructor = Instructor.find(params[:id])

INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Raul"], ["created_at", "2020-07-17 16:00:03.037851"], ["updated_at", "2020-07-17 16:00:03.037851"]]
---
    def create
        # byebug
        instructor = Instructor.create(instructor_params)

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Raul S."], ["updated_at", "2020-07-17 16:03:15.069951"], ["id", 4]]
---
    def update
        # byebug
        instructor = Instructor.find(params[:id])
        instructor.update(instructor_params)

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 4]]
---
    def destroy
        instructor = Instructor.find(params[:id])
        instructor.destroy