19-Rails-Validations/app/views/books/show.html.erb

<ul>
    <% @book.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "citations" ON "authors"."id" = "citations"."author_id" WHERE "citations"."book_id" = ?  [["book_id", 1]]