18-Rails-Associations/app/controllers/books_controller.rb

    def current_book
        @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]