18-Rails-Associations/app/controllers/dogs_controller.rb

    def create
        dog = Dog.create(dog_params)
---
INSERT INTO "dogs" ("name", "breed", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ruby"], ["breed", "Corgi"], ["age", 7], ["created_at", "2020-06-22 14:46:30.863271"], ["updated_at", "2020-06-22 14:46:30.863271"]]

    def update
        @dog.update(dog_params)
---
UPDATE "dogs" SET "age" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["age", 7], ["updated_at", "2020-06-22 15:19:51.545386"], ["id", 2]]

    def current_dog
        @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]