18-Rails-Associations/app/controllers/toys_controller.rb

    def index
        @toys = Toy.all
---
SELECT "toys".* FROM "toys"

    def new
        @toy = Toy.new
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def create
        # byebug

        toy = Toy.new(toys_params)

        #check if user is writting dog's name or not
        unless params[:toy][:dog][:name].empty?
            dog = Dog.create(dogs_params) # calling strongs params

            toy.dog_id = dog.id
        end

        toy.save
---
INSERT INTO "dogs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "java"], ["created_at", "2020-06-25 22:18:05.674959"], ["updated_at", "2020-06-25 22:18:05.674959"]]
INSERT INTO "toys" ("name", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["dog_id", 5], ["created_at", "2020-06-25 22:18:05.694965"], ["updated_at", "2020-06-25 22:18:05.694965"]]

    def current_toy
        @toy = Toy.find(params[:id])
---
SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]