18-Rails-Associations/app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_toy
        @toy = Toy.find(params[:id])