20-rails-review/app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    # byebug
    @instructor = Instructor.find(params[:id])