20-rails-review/app/controllers/students_controller.rb

SELECT "instructors".* FROM "instructors"
---
  def new
    @instructors = Instructor.all

INSERT INTO "students" ("name", "major", "age", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Chad"], ["major", "SE"], ["age", 21], ["instructor_id", 3], ["created_at", "2020-06-25 18:32:36.316633"], ["updated_at", "2020-06-25 18:32:36.316633"]]
---
  def create
    # byebug
    @student = Student.new(student_params)

    if @student.valid?
      @student.save

SELECT "instructors".* FROM "instructors"
---
  def edit
    # @student = Student.find(params[:id])
    @instructors = Instructor.all

UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Chad Palmer"], ["updated_at", "2020-06-25 19:13:37.437465"], ["id", 13]]
---
  def update
    # byebug
    # @student = Student.find(params[:id])
    @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def current_student
    @student = Student.find(params[:id])