20-rails-review/app/models/instructor.rb

    def avg_age
        # self.students.sum(&:age) / self.students.length
        self.students.average(:age)
---
SELECT "students".* FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 4]]
SELECT AVG("students"."age") FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 4]]